backend/app/controllers/liveposts_controller.rb

SELECT "liveposts".* FROM "liveposts"
---
  def index
    @liveposts = Livepost.all

INSERT INTO "liveposts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-06-24 19:40:22.138171"], ["updated_at", "2022-06-24 19:40:22.138171"]]
---
  def create
    respond_to do |format|
      @livepost = Livepost.new(livepost_params)
      format.html { redirect_to @livepost, notice: 'Document was successfully updated.' }
      format.json { render json: @livepost, status: :ok}
      @livepost.save

UPDATE "liveposts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "liveposts"."id" = ?  [["title", "dsadas"], ["description", "This is thdasdan"], ["updated_at", "2022-06-24 19:30:38.720363"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @livepost.update(livepost_params)

SELECT  "liveposts".* FROM "liveposts" WHERE "liveposts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_livepost
      @livepost = Livepost.find(params[:id])