backend/app/controllers/pendingposts_controller.rb

SELECT "pendingposts".* FROM "pendingposts"
---
  def index
    @pendingposts = Pendingpost.all

UPDATE "pendingposts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "pendingposts"."id" = ?  [["title", "Auto generated title 1dsfd"], ["description", "Auto generated description 1"], ["updated_at", "2022-06-23 14:11:18.008127"], ["id", 1]]
---
  def update
    if @pendingpost.update(pendingpost_params)

DELETE FROM "pendingposts" WHERE "pendingposts"."id" = ?  [["id", 1]]
---
  def destroy
    @pendingpost.destroy

SELECT  "pendingposts".* FROM "pendingposts" WHERE "pendingposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_pendingpost
      @pendingpost = Pendingpost.find(params[:id])