backend/app/controllers/pending_posts_controller.rb

SELECT "pending_posts".* FROM "pending_posts"
---
  def index
    @pending_posts = PendingPost.all