backend/app/controllers/pendings_controller.rb

  def index
    @pendings = Pending.all
---
SELECT "pendings".* FROM "pendings"

  def update
    respond_to do |format|
      if @pending.update(pending_params)
---
UPDATE "pendings" SET "category" = ?, "description" = ?, "updated_at" = ? WHERE "pendings"."id" = ?  [["category", "This is twcei w  fiwwfo n;acfoafo n;fea no;a"], ["description", "Th23321321ucf a wcfuc co nrc"], ["updated_at", "2022-06-22 16:19:36.113309"], ["id", 2]]

  def destroy
    @pending.destroy
---
DELETE FROM "pendings" WHERE "pendings"."id" = ?  [["id", 1]]

    def set_pending
      @pending = Pending.find(params[:id])
---
SELECT "pendings".* FROM "pendings" WHERE "pendings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]